Repository: itu-itis21-kurtulusu20/ma3api-migration
Catalog: api-common/csharp/Properties/Resource.*.resx
Languages: tr_tr

# AGREEMENTALG_BILINMIYOR
source: Unknown Agreement Algorithm
tr_tr: Bilinmeyen anahtar anlaşması (agreement)

# AKI_ID
source: AKI
tr_tr: Anahtar Kimliği

# AKI_ISSUER
source: Certificate Issuer
tr_tr: Yetkili Sertifikasını veren

# AKI_SERIAL
source: Certificate Serial Number
tr_tr: Yetkili Sertifika seri numarası

# ARGUMAN_BILINMIYOR
source: Given argument is not known!
tr_tr: Verilen argüman bilinmiyor!

# ASKIDA
source: On Hold Certificate
tr_tr: Sertifika Askıda

# ASN1_ENCODE_HATASI
source: Error occurred while encoding the Asn1 structure!
tr_tr: Asn1 yapısı ENCODE edilirken hata ile karşılaşıldı!

# AUTHORITY_SUBJECT_KEY_IDENTIFIER_UYUMLU
source: Certificate Authority Subject Key Identifier is Same with Certificate Authority Key Identifier
tr_tr: Sertifikadaki Yetkili Anahtar Tanımlayıcısı ile SM Sertifikasındaki Konu Anahtar Tanımlayıcısı Uyumlu

# AUTHORITY_SUBJECT_KEY_IDENTIFIER_UYUMSUZ
source: Certificate Authority Subject Key Identifier is not Same with Certificate Authority Key Identifier
tr_tr: Sertifikadaki Yetkili Anahtar Tanımlayıcısı ile SM Sertifikasındaki Konu Anahtar Tanımlayıcısı Uyumsuz

# AYNI_EXTENSION_BIRDEN_FAZLA
source: More than one the same extension in the certificate
tr_tr: Sertifikada Aynı Eklentiden Birden Fazla Var

# BASARILI
source: Successful
tr_tr: Başarılı

# BASE_SILDE_ASKIYA_ALINAN_DELTADA_REMOVE_EDILMIS
source: Certificate in Base CRL is not in Delta CRL
tr_tr: Base Silde Askıya Alınmış Sertifika Delta Silde Çıkarılmış

# BASIC_CONST_CA_KONTROLU
source: Checking CA Value in Basic Constraints
tr_tr: Temel Kısıtlamalar CA Kontrolü

# BASIC_CONST_EKLENTISI_BOZUK
source: Basic Constraint Extension is Corrupted
tr_tr: Temel Kısıtlamalar Eklentisi Bozuk

# BASIC_CONST_EKLENTI_CA_DEGERI_DOGRU
source: CA Value of Basic Constraints Extension is True
tr_tr: Temel Kısıtlamalar Eklentisi CA Değeri Doğru

# BASIC_CONST_EKLENTI_CA_DEGERI_YANLIS
source: CA Value of Basic Constraints Extension is Wrong
tr_tr: Temel Kısıtlamalar Eklentisi CA Değeri Yanlış

# BASIC_CONST_EKLENTI_CA_DEGERI_YOK
source: There is No CA value of Basic Constraints Extension
tr_tr: Temel Kısıtlamalar Eklentisi CA Değeri Yok

# BASIC_CONST_EKLENTI_LEN_CONS_DEGERI_ASILDI
source: Path Length Constraint Value in Basic Constraints Extension has Exceeded
tr_tr: Temel Kısıtlar Eklentisinde Yol Uzunluğu Kısıtlayıcısı Değeri Aşıldı

# BASIC_CONST_EKLENTI_LEN_CONS_DEGERI_GECERLI
source: Path Length Constraint Value in Basic Constraints Extension is Valid
tr_tr: Temel Kısıtlar Eklentisinde Yol Uzunluğu Kısıtlayıcısı Değeri Geçerli

# BASIC_CONST_EKLENTI_LEN_CONS_DEGERI_NEGATIF
source: Path Length Constraint Value in Basic Constraints Extension is Negative
tr_tr: Temel Kısıtlar Eklentisinde Yol Uzunluğu Kısıtlayıcısı Değeri Negatif

# BASIC_CONST_EKLENTI_LEN_CONS_DEGERI_YOK
source: There is no Path Length Constraint Value in Basic Constraints Extension
tr_tr: Temel Kısıtlar Eklentisinde Yol Uzunluğu Kısıtlayıcısı Yok

# BASIC_CONST_EKLENTI_YOK
source: Basic Constraints Extension does not Exist
tr_tr: Temel Kısıtlamalar Eklentisi Yok

# BASIT_ALANLAR_VAR_DOGRU
source: There are Basic Fields with Version 1 or higher
tr_tr: Basit Alanlar var, versiyon 1 veya üstü

# BASIT_ALANLAR_VAR_YANLIS
source: There are Basic Fields, But Those are not Version 1 or higher
tr_tr: Basit Alanlar var, versiyon 1 veya üstü değil

# BC_CA
source: Certificate Authority
tr_tr: Sertifika Makamı

# BC_CA_DEGIL
source: Not CA
tr_tr: Sertifika Makamı Değil

# BC_PATH
source: Path Length Constraint
tr_tr: Yol Uzunluğu Kısıtlaması

# BC_TYPE
source: Subject Type
tr_tr: Özne Türü

# CERTIFICATE_CHECKER_FAIL
source: {0} failed
tr_tr: {0} başarısız

# CERTIFICATE_NO_PATH_FOUND
source: No trusted path found. Certificate's root certificate may not be one of your trusted certificates
tr_tr: Güvendiğiniz bir sertifika zinciri oluşturulamadı. Sertifikanın kök sertifikası güvenilir sertifikalarınızdan biri olmayabilir

# CERTIFICATE_VALIDATION_SUCCESSFUL
source: Certificate validation is successful
tr_tr: Sertifika doğrulama başarılı

# CERTIFICATE_VALIDATION_UNSUCCESSFUL
source: Certificate validation is unsuccessful. Validation status : {0}
tr_tr: Sertifika doğrulaması başarısız. Doğrulama durumu: {0}

# CERTSIGN
source: Certificate Signing
tr_tr: Sertifika İmzalama

# CERT_HATALI
source: Error in given certificate!
tr_tr: Verilen sertifika hatalı!

# CEVAPTA_SERTIFIKA_YOK
source: OCSP Response Does Not Include a Certificate
tr_tr: OCSP Cevabında Sertifika Yok

# CEVAP_IMZALI_DEGIL
source: OCSP Response Not Signed
tr_tr: OCSP Cevabı İmzalı Değil

# CEVAP_YAPISI_BOZUK
source: OCSP Response Structure Corrupt
tr_tr: OCSP Cevap Yapısı Bozuk

# CORRUPT_DATE_INFO
source: Corrupted date info
tr_tr: Tarih bilgisine erişilemiyor

source: CountryCitizenship
tr_tr: CountryCitizenship (Uyruk)

source: Country Residence
tr_tr: CountryResidence (İkamet Edilen Ülke)

# CRLSIGN
source: CRL Signing
tr_tr: SİL İmzalama

# DATAENCIPHERMENT
source: Data encipherement
tr_tr: Veri Şifreleme

source: Date Of Birth
tr_tr: DateOfBirth (Doğum Tarihi)

# DELTA_CRL_INDICATOR_KONTROLU
source: Delta Crl Indicator Control
tr_tr: Delta Sil Belirleyici Kontrolü

# DELTA_CRL_INDICATOR_VAR
source: Delta Crl Indicator Exists
tr_tr: Delta Sil Belirleyici Var

# DELTA_CRL_INDICATOR_YOK
source: No Delta Crl Indicator
tr_tr: Delta Sil Belirleyici Yok

source: Digital Signature
tr_tr: Sayısal İmza

# DOGRULAMA_KRIPTO_HATASI
source: Validation Crypto Error
tr_tr: Doğrulama Kripto Hatası

# ECDSAANAHTARBOYU_0_BILINMIYOR
source: The parameters for ECDSA key length {0} are not known.
tr_tr: ECDSA Anahtar boyu {0} icin parametreler bilinmiyor.

# EKLENTILER_GECERLI
source: Extensions in the certificate are valid
tr_tr: Sertifika Eklentileri Geçerli

# EKLENTI_YOK
source: No extensions in certificate
tr_tr: Sertifikada Eklenti Yok

# EKU_CLIENT_AUTHENTICATION
source: Client Authentication
tr_tr: İstemci Tanıma

# EKU_CODE_SIGNING
source: Code Signing
tr_tr: Kod İmzalama

# EKU_EMAIL_PROTECTION
source: E-mail protection
tr_tr: Elektronik Posta Koruma

# EKU_IPSEC_END_SYSTEM
source: IPSEC End System
tr_tr: IPSEC Sonlandırma Sistemi

# EKU_IPSEC_USER
source: IPSEC User
tr_tr: IPSEC Kullanıcısı

# EKU_OCSP_SIGNING
source: OCSP Signing
tr_tr: OCSP İmzalama

# EKU_SERVER_AUTHENTICATION
source: Server Authentication
tr_tr: Sunucu Tanıma

# EKU_TIME_STAMPING
source: Time Stamping
tr_tr: Zaman Damgası

# ENCRYPTIONCERT_KEY_USAGE_KONTROLU
source: Encryption Certificate Key Usage Control
tr_tr: Şifreleme Sertifikası Anahtar Kullanımı Eklentisi Kontrolü

# EXTENDEDKEY_USAGE_BOZUK
source: Invalid Extended Key Usage Extension
tr_tr: Gelişmiş Anahtar Kullanımı Eklentisi Geçersiz

# EXTENDEDKEY_USAGE_GECERLI
source: Extended Key Usage Extension validated
tr_tr: Anahtar Kullanımı Eklentisi Sertifika İmzalayıcı Değil

# EXTENDEDKEY_USAGE_YOK
source: No Extended Key Usage Extension
tr_tr: Gelişmiş Anahtar Kullanımı Eklentisi Yok

# EXTENSION_VAR_DOGRU
source: There is a Version 3 Extension
tr_tr: Eklenti var, versiyon 3

# EXTENSION_VAR_YANLIS
source: There is an Extension, But Its not Version 3
tr_tr: Eklenti var, versiyon 3 değil

# FRESHEST_CRL_KONTROLU
source: Freshest Crl Control
tr_tr: Freshest Sil Kontrolü

# FRESHEST_CRL_VAR
source: Freshest Crl Exists
tr_tr: Freshest Sil Var

# FRESHEST_CRL_YOK
source: No Freshest Crl
tr_tr: Freshest Sil Yok

# GECERLI
source: Valid Certificate
tr_tr: Sertifika Geçerli

# GECERSIZ_EKLENTI
source: Invalid extension in certificate
tr_tr: Sertifikada Geçersiz Bir Eklenti Var

source: Gender
tr_tr: Gender (Cinsiyet)

# HATA_IMZA_PAKETI_BILINMEYEN_UZANTI_EKSIK_MIMETYPE
source: Unknown Extension and missing Mimetype!
tr_tr: Bilinmeyen Uzantı ve eksik Mimetype!

# HATA_IMZA_PAKETI_DESTEKLENMIYOR
source: Signature package is not supported: {0} - {1}
tr_tr: İmza Paketi desteklenmiyor: {0} - {1}

# HATA_IMZA_PAKETI_UZANTI_MIMETYPE_UYUZMAZLIK
source: Extension ({0}) and mimetype ({1}) does not match
tr_tr: Uzantı ({0}) ve mimetype ({1}) uyuşmuyor

# IMZALAYAN_SERTIFIKA_GECERLI
source: Signer Certificate Valid
tr_tr: İmzalayan Sertifika Geçerli

# IMZALAYAN_SERTIFIKA_GECERSIZ
source: Signer Certificate Invalid
tr_tr: İmzalayan Sertifika Geçersiz

# IMZALG_0_BILINMIYOR
source: Signing algorithm {0} is not known!
tr_tr: İmzalama algoritması {0} bilinmiyor!

# IMZA_ANAHTAR_ALGORITMA_UYUMSUZLUGU
source: Incompatible key type and signing algorithm
tr_tr: Seçilen imzalama algoritması ile kullanılan anahtar tipi uyumsuz

# IMZA_DOGRULANAMADI
source: OCSP Response Signature Could Not Be Validated
tr_tr: OCSP Cevabı İmzası Doğrulanamadı

# IMZA_DOGRULANDI
source: OCSP Response Signature Validated
tr_tr: OCSP Cevabı İmzası Doğrulandı

# IMZA_PAKETI_IMZA_KONTEYNERI_BULUNAMADI
source: No signature container found in package
tr_tr: Pakette herhangi bir imza konteyneri bulunamadı

# INIT_EDILMIS
source: Already initialized!
tr_tr: Daha önce "initialize" edilmiş!

# INVALID_DATE_INFO
source: Date check failed
tr_tr: Tarih kontrolu başarısız

# IPTAL_EDILMIS
source: Revoked Certificate
tr_tr: Sertifika İptal Edilmiş

# IPTAL_KONTROLU_SORUNLU
source: Problem in Revocation Control
tr_tr: İptal Kontrolü Sorunlu

# ISSUER_SUBJECT_UYUMLU
source: Issuer of Certificate Matches the Subject of CA Certificate
tr_tr: Sertifikadaki Issuer ile SM Sertifikasındaki Subject Değerleri Uyumlu

# ISSUER_SUBJECT_UYUMSUZ
source: Issuer of Certificate does not match the Subject of CA Certificate
tr_tr: Sertifikadaki Issuer ile SM Sertifikasındaki Subject Değerleri Uyumsuz

# KARTTA_0_ANAHTARI_YOK
source: Key {0} is not found in the card!
tr_tr: Kartta {0} isminde anahtar bulunamadı!

source: Key Agreement
tr_tr: Anahtar Anlaşması

source: Key Encipherment
tr_tr: Anahtar Şifreleme

# KEY_IDENTIFIER_KONTROLU
source: Key Identifier Check
tr_tr: Anahtar Tanımlayıcısı Kontrolü

# KEY_USAGE_BOZUK
source: Corrupted Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Yapısı Bozuk

# KEY_USAGE_SERTIFIKA_IMZALAYICI
source: KeyCertSign Bit is Asserted in Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Sertifika İmzalayıcı

# KEY_USAGE_SERTIFIKA_IMZALAYICI_DEGIL
source: KeyCertSign Bit is not Asserted in Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Sertifika İmzalayıcı Değil

# KEY_USAGE_SERTIFIKA_SIFRELEME
source: Key Encipherment Bit is Asserted in Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Şifreleme

# KEY_USAGE_SIL_IMZALAYICI
source: CRLSign Bit is Asserted in Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Sil İmzalayıcı

# KEY_USAGE_SIL_IMZALAYICI_DEGIL
source: CRLSign Bit is not Asserted in Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Sil İmzalayıcı Değil

# KEY_USAGE_YOK
source: No Key Usage Extension
tr_tr: Anahtar Kullanımı Eklentisi Yok

# KONTROL_SONUCU
source: Control Result
tr_tr: Kontrol Sonucu

# KRIPTO_GENEL_HATA
source: General error in crypto processes!
tr_tr: Kripto işlemlerinde genel bir hata ile karşılaşıldı!

# MESAJ_ESNEKZDYOK
source: Permissive timestamp field could not be found in the licence. Please renew the licence file!
tr_tr: Lisans dosyasında esnek zaman damgası alanı bulunamadı. Lisans dosyasını yenileyiniz!

# NITELIKLI_COMPLIANCE
source: This is an ETSI TS 101 862 Compliant Qualified Digital Certificate.
tr_tr: Bu sertifika, ETSI TS 101 862 standardına göre oluşturulmuş nitelikli elektronik sertifikadır.

# NITELIKLI_MONEY_LIMIT
source: Money Limit
tr_tr: Para Limiti

# NITELIKLI_TK
source: This certificate complies with the Telekomünikasyon Kurumu Qualified Digital Certificate Profile.
tr_tr: Telekomünikasyon Kurumu tarafından belirlenmiş nitelikli elektronik sertifika profiline uygundur.

# NONREPUDIATION
source: Non Repudation
tr_tr: Red Olmayan

source: No Path found
tr_tr: Sertifika Zinciri tespit edilemedi

# NO_TRUSTED_CERT_FOUND
source: Could not find any trusted certificate.
tr_tr: Hiç Güvenilir Sertifika Bulunamadı

# OCSPDEN_IPTAL_KONTROLU
source: CRL control from OCSP
tr_tr: OCSPden İptal Kontrolü

# OCSP_CEVABI_BULUNAMADI
source: OCSP answer is not found
tr_tr: OCSP Cevabı Bulunamadı

# OCSP_CEVABI_GECERSIZ
source: Invalid OCSP answer
tr_tr: OCSP Cevabı Geçersiz

# OCSP_CEVABI_KONTROLCU
source: OCSP Response Control
tr_tr: OCSP Cevabı Kontrolu

# OCSP_IMZALAYAN_SERTIFIKA_KONTROLU
source: OCSP Signer Certificate Control
tr_tr: OCSP İmzalayıcı Sertifika Kontrolü

# OCSP_IMZA_KONTROLU
source: OCSP Response Signature Control
tr_tr: OCSP Cevabı İmza Kontrolü

# OCSP_RESPONSEDATE_EXPIRED
source: OCSP date expired
tr_tr: OCSP zamanı geçerli değil

# OCSP_RESPONSEDATE_INVALID
source: OCSP date invalid
tr_tr: OCSP zamanı geçerli değil

# OZETALG_0_BILINMIYOR
source: Hash algorithm is not known!
tr_tr: Özet algoritması bilinmiyor!

# PADDING_BILINMIYOR
source: Given padding is not known!
tr_tr: Verilen padding bilinmiyor!

# PATH_LEN_CONSTRAINT_KONTROLU
source: Path Length Constraint Check
tr_tr: Yol Uzunluğu Kısıtlayıcısı Kontrolü

source: Place of Birth
tr_tr: Doğum Yeri

# PM_IDP
source: Issuer Domain Policy
tr_tr: Sertifika Sağlayıcı Alan İlkesi

# PM_SDP
source: Subject Domain Policy
tr_tr: Konu Alan İlkesi

source: Policy ID
tr_tr: İlke Niteleyici Kimliği

source: Policy Identifier
tr_tr: İlke Tanımlayıcısı

source: Policy Info
tr_tr: İlke Niteleyici Bilgisi

# POLICY_NOTICE
source: User Notice
tr_tr: Kullanıcı Notu

source: Policy Qualifier
tr_tr: Niteleyici

# PVR_BASICCONSTRAINTS_FAILURE
source: Certificate basic constraints check failure
tr_tr: Sertifika Temel Kısıtlamalar kontrolü başarısız

# PVR_CDP_CONTROL_FAILURE
source: Certificate CRL Distribution Points check failure
tr_tr: Sertifika SİL Dağıtım Noktaları kontrolü başarısız

# PVR_CERTIFICATE_EXPIRED
source: Certificate expired
tr_tr: Sertifika geçerlilik süresi dolmuş

# PVR_CERTIFICATE_EXTENSIONS_FAILURE
source: Cant check certificate extensions
tr_tr: Sertifika Eklenti kontrolü başarısız

# PVR_CERTIFICATE_REVOKED
source: Certificate is revoked.
tr_tr: Sertifika iptal edilmiş

# PVR_CRL_DELTACRLINDICATOR_CONTROL_FAILURE
source: CRL delta crl indicator check failure
tr_tr: SİL Delta Sil Belirteci Eklentisi kontrolü başarısız

# PVR_CRL_EXPIRED
source: CRL expired
tr_tr: SİL geçerlilik süresi dolmuş

# PVR_CRL_EXTENSIONS_CONTROL_FAILURE
source: CRL extensions check failure
tr_tr: SİL Eklentileri kontrolü başarısız

# PVR_CRL_FRESHESTCRL_CONTROL_FAILURE
source: CRL freshest extension check failure
tr_tr: SİL En Güncel SİL Eklentisi kontrolü başarısız

# PVR_CRL_KEYUSAGE_CONTROL_FAILURE
source: CRL key usage check failure
tr_tr: SİL Anahtar Kullanımı kontrolü başarısız

# PVR_CRL_NAME_CONTROL_FAILURE
source: CRL name check failure
tr_tr: SİL İsim kontrolü başarısız

# PVR_CRL_SIGNATURE_CONTROL_FAILURE
source: CRL signature check failure
tr_tr: SİL İmza kontrolü başarısız

# PVR_EXTENDED_KEYUSAGE_CONTROL_FAILURE
source: Certificate extended key usage check failure.
tr_tr: Sertifika Gelişmiş Anahtar Kullanımı kontrolü başarısız.

# PVR_INCOMPLETE_VALIDATION
source: Certificate validation cant be completed
tr_tr: Sertifika Doğrulama tamamlanamadı

# PVR_INVALID_PATH
source: Invalid certificate path
tr_tr: Geçersiz Sertifika Zinciri

# PVR_KEYID_CONTROL_FAILURE
source: Certificate KeyId check failure
tr_tr: Sertifika Anahtar Tanımlayıcısı kontrolü başarısız

# PVR_KEYUSAGE_CONTROL_FAILURE
source: Certificate key usage check failure
tr_tr: Sertifika Anahtar Kullanımı kontrolü başarısız

# PVR_NAMECONSTRAINTS_FAILURE
source: Certificate name constraints check failure
tr_tr: Sertifika İsim Kısıtlamaları kontrolü başarısız

# PVR_NAME_CONTROL_FAILURE
source: Certificate name check failure
tr_tr: Sertifika İsim kontrolü başarısız

# PVR_NO_PATHFOUND
source: Certificate path cant be found
tr_tr: Geçerli zincir bulunamadı

# PVR_OCSP_DATE_CONTROL_FAILURE
source: OCSP date control failed
tr_tr: OCSP zamanı geçerli değil

# PVR_OCSP_RESPONSESTATUS_CONTROL_FAILURE
source: OCSP response status check failure
tr_tr: OCSP Cevap Durumu kontrolü başarısız

# PVR_OCSP_SIGNATURE_CONTROL_FAILURE
source: OCSP signature check failure
tr_tr: OCSP İmza kontrolü başarısız

# PVR_PATHLENCONSTRAINTS_FAILURE
source: Certificate path length constraints check failure
tr_tr: Sertifika Yol Uzunluğu kontrolü başarısız

# PVR_POLICYCONSTRAINTS_CONTROL_FAILURE
source: Certificate policy constraints check failure
tr_tr: Sertifika Politika Kısıtlamaları kontrolü başarısız

# PVR_POLICYMAPPING_CONTROL_FAILURE
source: Certificate policy mapping check failure
tr_tr: Sertifika Politika Eşleştirmeleri kontrolü başarısız

# PVR_REVOCATION_CONTROL_FAILURE
source: Certificate revocation check failure.
tr_tr: Sertifika iptal kontrolü yapılamadı

# PVR_SERIALNUMBER_NOT_POSITIVE
source: Serial number negative
tr_tr: Seri Numarası negatif

# PVR_SIGNATURE_ALGORITHM_DIFFERENT
source: Certificate and signing algorithm mismatch
tr_tr: Sertifika ve imza algoritması uyuşmuyor

# PVR_SIGNATURE_CONTROL_FAILURE
source: Certificate signature check failure.
tr_tr: Sertifika İmza kontrolü başarısız

# PVR_SUCCESS
source: Successful
tr_tr: Başarılı

# PVR_UNSPECIFIED_FAILURE
source: Unspecified error
tr_tr: Tanımlanmamış hata

# PVR_VERSION_CONTROL_FAILURE
source: Certificate version check failure
tr_tr: Sertifika versiyon kontrolü başarısız

source: Role
tr_tr: Role (Görev)

# SC_SELECTOR_NOT_GIVEN
source: Smart Card selector is not given
tr_tr: Akıllı Kart Seçici Verilmedi

# SELECT_SC
source: Choose Smart Card
tr_tr: Akıllı Kart Seçin

# SERI_NO_KONTROLU
source: Serial number control
tr_tr: Seri Numarası Kontrolü

# SERI_NO_NEGATIF
source: Serial number is negative
tr_tr: Seri Numarası Negatif

# SERI_NO_POZITIF
source: Serial number is positive
tr_tr: Seri Numarası Pozitif

# SERTIFIKADA_ACIK_ANAHTAR_BOZUK
source: Corrupted Public Key in Certificate
tr_tr: Sertifikadaki Açık Anahtar Bozuk

# SERTIFIKADA_ACIK_ANAHTAR_YOK
source: No Public Key In Certificate
tr_tr: Sertifikada Açık Anahtar Yok

# SERTIFIKA_AUTHORITY_KEY_IDENTIFIER_YOK
source: Certificate Authority Key Identifier does not Exist
tr_tr: Sertifikada Yetkili Anahtar Tanımlayıcısı Yok

# SERTIFIKA_DELTA_SILDE
source: Certificate is revoked in Delta CRL
tr_tr: Sertifika Delta Silde İptal Edilmiş

# SERTIFIKA_DELTA_SILDE_REMOVE_EDILMIS
source: Certificate is not in Delta CRL
tr_tr: Sertifika Delta Silde Çıkarılmış

# SERTIFIKA_EKLENTI_KONTROLU
source: Certificate extension control
tr_tr: Sertifika Eklenti Kontrolü

# SERTIFIKA_EXTENDED_KEY_USAGE_KONTROLU
source: Certificate Extended Key Usage Check
tr_tr: Sertifika Gelişmiş Anahtar Kullanımı Eklentisi Kontrolü

# SERTIFIKA_IMZALI_DEGIL
source: Unsigned Certificate
tr_tr: Sertifika İmzalı Değil

# SERTIFIKA_IMZA_DOGRULANAMADI
source: Certificate Signature is not Validated
tr_tr: Sertifika İmzası Doğrulanamadı

# SERTIFIKA_IMZA_DOGRULANDI
source: Certificate Signature Validated
tr_tr: Sertifika İmzası Doğrulandı

# SERTIFIKA_IMZA_KONTROLU
source: Certificate Signature Validation
tr_tr: Sertifika İmza Kontrolü

# SERTIFIKA_ISSUER_YOK
source: No Issuer Field in Certificate
tr_tr: Sertifikada Issuer Yok

# SERTIFIKA_KEYUSAGE_HATALI
source: Certificate key usage field is invalid.
tr_tr: Sertifika anahtar kullanım alanı hatalı.

# SERTIFIKA_KEY_USAGE_KONTROLU
source: Certificate Key Usage Extension Control
tr_tr: Sertifika Anahtar Kullanımı Eklentisi Kontrolü

# SERTIFIKA_KULLANICI_NOTU_YOK
source: There is no usetr notice in the certificate.
tr_tr: Sertifika Kullanıcı Notu Yok

# SERTIFIKA_LISTEDE
source: Certificate is revoked in CRL
tr_tr: Sertifika Silde İptal Edilmiş

# SERTIFIKA_LISTEDE_DEGIL
source: Certificate is not in CRL
tr_tr: Sertifika Silde Yok

# SERTIFIKA_NAME_KONTROLU
source: Certificate Name Validation
tr_tr: Sertifika Name Kontrolü

# SERTIFIKA_NITELIKLI_IBARESI_YOK
source: There is no qualified extension in the certificate.
tr_tr: Sertifikada nitelikli ibaresi bulunamadı.

# SERTIFIKA_NITELIKLI_KONTROLU
source: Qualified Certificate Control
tr_tr: Nitelikli Sertifika Kontrolü

# SERTIFIKA_NITELIKLI_KONTROLU_BASARILI
source: Qualified certificate control is successfull.
tr_tr: Nitelikli sertifika kontrolü başarılı.

# SERTIFIKA_OCSPDE_GECERLI
source: Certificate is good in OCSP answer
tr_tr: Sertifika OCSPde Geçerli

# SERTIFIKA_OCSPDE_GECERLI_DEGIL
source: Certificate is revoked in OCSP answer
tr_tr: Sertifika OCSPde Geçerli Değil

# SERTIFIKA_OCSP_SERTIFIKASI_DEGIL
source: OCSP Response Certificate Is Not an OCSP Certificate
tr_tr: OCSP Cevabındaki Sertifika OCSP Sertifikası Değil

# SERTIFIKA_SORUNLU
source: Problem in Certificate
tr_tr: Sertifika Sorunlu

# SERTIFIKA_SURESI_DOLMUS
source: Certificate is expired
tr_tr: Sertifika süresi dolmuş

# SERTIFIKA_TARIH_BILGISI_BOZUK
source: Certificate date is invalid
tr_tr: Sertifika Tarih Bilgisi Yapısı Bozuk

# SERTIFIKA_TARIH_GECERLI
source: Certificate is not expired
tr_tr: Sertifika Tarihi Geçerli

# SERTIFIKA_TARIH_GECERSIZ
source: Certificate is expired
tr_tr: Sertifika Tarihi Geçersiz

# SERTIFIKA_TARIH_KONTROLU
source: Certificate validity control
tr_tr: Sertifika Geçerlilik Tarihi Kontrolü

# SERTIFIKA_YAPISI_BOZUK
source: Corrupted Certificate
tr_tr: Sertifika Yapısı Bozuk

# SIGNATURE_ALG_AYNI
source: Signature Algorithm values are Same
tr_tr: İmzalama Algoritması Değerleri Aynı

# SIGNATURE_ALG_AYNIMI_KONTROLU
source: Checking Signature Algorithm is Same or not
tr_tr: İmzalama Algoritması Aynımı Kontrolü

# SIGNATURE_ALG_FARKLI
source: Signature Algorithm values are Different
tr_tr: Imzalama Algoritması Değerleri Farklı

# SILDEN_IPTAL_KONTROLU
source: Revocation check from CRL
tr_tr: Silden İptal Kontrolü

# SIL_BULUNAMADI
source: CRL is not found
tr_tr: Sil Bulunamadı

# SIL_EKLENTI_KONTROLU
source: CRL Extension Validation
tr_tr: Sil Eklenti Kontrolü

# SIL_GECERSIZ
source: CRL is invalid
tr_tr: Sil Geçersiz

# SIL_IMZALI_DEGIL
source: Unsigned CRL
tr_tr: Sil İmzalı Değil

# SIL_IMZA_DOGRULANAMADI
source: CRL Signature is not Validated
tr_tr: Sil İmzası Doğrulanamadı

# SIL_IMZA_DOGRULANDI
source: CRL Signature Validated
tr_tr: Sil İmzası Doğrulandı

# SIL_IMZA_KONTROLU
source: CRL Signature Validation
tr_tr: Sil İmza Kontrolü

# SIL_KEY_USAGE_KONTROLU
source: CRL Key Usage Extension Control
tr_tr: Sil Anahtar Kullanımı Eklentisi Kontrolü

# SIL_NAME_KONTROLU
source: CRL Name Validation
tr_tr: Sil Name Kontrolü

# SIL_TARIH_KONTROLU
source: CRL Date Validation
tr_tr: Sil Tarih Kontrolü

# SIL_YAPISI_BOZUK
source: Corrupted CRL
tr_tr: Sil Yapısı Bozuk

# SIMMOD_BILINMIYOR
source: Unknown symmetric mode!
tr_tr: Verilen simetrik algoritma modu bilinmiyor!

# SMSERTIFIKA_SUBJECT_KEY_IDENTIFIER_YOK
source: Certificate Authority Subject Key Identifier does not Exist
tr_tr: SM Sertifikasında Konu Anahtar Tanımlayıcısı

# SMSERTIFIKA_SUBJECT_YOK
source: No Subject Field in CA Certificate
tr_tr: SM Sertifikasında Subject Yok

# SM_SERTIFIKASI_BULUNAMADI
source: Issuer certificate is not found
tr_tr: SM Sertifikası Bulunamadı

# UID_VAR_DOGRU
source: There is a UID with Version 2 or higher
tr_tr: UID var, versiyon 2 veya üstü

# UID_VAR_YANLIS
source: There is a UID, But Its nor Version 2 or higher
tr_tr: UID var, versiyon 2 veya üstü değil

source: Unknown
tr_tr: Bilinmiyor

# VALID_DATE_INFO
source: Date check is valid
tr_tr: Tarih kontrolu başarılı

source: Version
tr_tr: Versiyon

# ZINCIR_SORUNLU
source: Problem in Certification Path
tr_tr: Sertifika Zinciri Sorunlu

# WRONG_FORMAT_QCC_STATEMENT
source: The format of the qualified certificate checker parameter entered in the xml file is incorrect.
tr_tr: Xml dosyasında girilen qualified certificate checker parametresinin formatı yanlış.
