Repository: itu-itis21-kurtulusu20/ma3api-migration
Catalog: api-cmssignature/csharp/Properties/Resource.*.resx
Languages: tr_tr

# ALL_CHECKERS_SUCCESSFULL
source: All checker results are successful.
tr_tr: Kontrolcülerin sonuçları başarılı.

# ALL_CHECKERS_UNSUCCESSFULL
source: All checker results are unsuccessful.
tr_tr: Kontrolcülerin sonuçları başarısız.

source: Archive TimeStamp Attribute Checker
tr_tr: Arşiv Zaman Damgası Özelliği Kontrolcüsü

source: Archive TimeStamp V2 Attribute Checker
tr_tr: Arşiv Zaman Damgası V2 Özelliği Kontrolcüsü

# ARCHIVE_TSA_CHECK_SUCCESSFUL
source: Archive Time Stamp attribute check is successful.
tr_tr: Arşiv zaman damgası özelliği kontrolü başarılı.

# ARCHIVE_TSA_CHECK_UNSUCCESSFUL
source: Archive Time Stamp attribute check is unsuccessful.
tr_tr: Arşiv zaman damgası özelliği kontrolü başarısız.

# ARCHIVE_TSA_DECODE_ERROR
source: Archive Time Stamp attribute can not be decoded in Signed Data.
tr_tr: Arşiv zaman damgası özelliği decode edilemedi.

# ARCHIVE_TSA_V2_CHECK_SUCCESSFUL
source: Archive Time Stamp V2 attribute check is successful.
tr_tr: Arşiv zaman damgası V2 özelliği kontrolü başarılı.

# ARCHIVE_TSA_V2_CHECK_UNSUCCESSFUL
source: Archive Time Stamp V2 attribute check is unsuccessful.
tr_tr: Arşiv zaman damgası V2 özelliği kontrolü başarısız.

# ARCHIVE_TSA_V2_DECODE_ERROR
source: Archive Time Stamp V2 attribute can not be decoded in Signed Data.
tr_tr: Arşiv zaman damgası V2 özelliği decode edilemedi.

# CADESC_TSA_CHECK_SUCCESSFUL
source: CAdES_C Time Stamp attribute check is successful.
tr_tr: CAdES_C zaman damgası özelliği kontrolü başarılı.

# CADESC_TSA_CHECK_UNSUCCESSFUL
source: CAdES_C Time Stamp attribute check is unsuccessful.
tr_tr: CAdES_C zaman damgası özelliği kontrolü başarısız.

# CADESC_TSA_DECODE_ERROR
source: CAdES_C Time Stamp attribute can not be decoded in Signed Data.
tr_tr: CAdES_C zaman damgası özelliği decode edilemedi.

source: CAdES_C_TimeStamp Attribute Checker
tr_tr: CAdES_C Zaman Damgası Özelliği Kontrolcüsü

# CertificateRefsValuesMatchChecker_SUCCESSFUL
source: Certificate References and Values matching is successful.
tr_tr: Sertifika referansları ve değerleri eşleştirme kontrolü başarılı.

# CertificateRefsValuesMatchChecker_UNSUCCESSFUL
source: Certificate References and Values matching is unsuccessful.
tr_tr: Sertifika referansları ve değerleri eşleştirme kontrolü başarısız.

source: Certificate References Values Match Checker
tr_tr: Sertifika Referans - Değer Uyumluluk Kontrolcüsü

source: Certificate Validation Checker
tr_tr: Sertifika Geçerlilik Kontrolcüsü

# CERTIFICATE_VALIDATION_SUCCESSFUL
source: Signer Certificate validation is successful
tr_tr: İmzacı sertifikası doğrulaması başarılı.

# CERTIFICATE_VALIDATION_UNSUCCESSFUL
source: Signer Certificate validation is unsuccessful. Validation status : {0}
tr_tr: İmzacı sertifikası doğrulaması başarısız. Doğrulama durumu: {0}

# CERTIFICATE_VALUES_ATTRIBUTE_DECODE_ERROR
source: Certificate Values attribute can not be decoded in Signed Data.
tr_tr: Sertifika değerleri özelliği decode edilemedi.

# CERT_HASH_DOESNOT_MATCH
source: Certificate hash value in attribute is not same as signer certificate hash value.
tr_tr: Özellikteki sertifika özet alanı, imzacı sertifikanın özetiyle aynı değil.

source: Check All Checker
tr_tr: Kontrolcü Topluluğu

source: Check One Checker
tr_tr: Tek Kontrolcü

# COMPLETE_CERTIFICATE_REFERENCES_DECODE_ERROR
source: Complete Certificate References attribute can not be decoded in Signed Data.
tr_tr: Sertifika referansları özelliği decode edilemedi.

source: Content TimeStamp Attribute Checker
tr_tr: İçerik Zaman Damgası Özelliği Kontrolcüsü

# CONTENT_TIMESTAMP_ATTRIBUTE_CHECKER_SUCCESSFUL
source: Content Timestamp check is successful.
tr_tr: İçerik Zaman Damgası özelliği kontrolü başarılı.

# CONTENT_TIMESTAMP_ATTRIBUTE_CHECKER_UNSUCCESSFUL
source: Content Timestamp check is unsuccessful.
tr_tr: İçerik Zaman Damgası özelliği kontrolü başarısız.

# CONTENT_TIMESTAMP_ATTRIBUTE_DECODE_ERROR
source: Content Timestamp can not be decoded.
tr_tr: İçerik Zaman Damgası özelliği decode edilemedi.

source: Content Type Attribute Checker
tr_tr: İçerik Tipi Özelliği Kontrolcüsü

# CONTENT_TYPE_ATTRIBUTE_CHECKER_SUCCESSFUL
source: Content Type attribute check is successful.
tr_tr: İçerik Tipi özelliği kontrolcüsü başarılı.

# CONTENT_TYPE_ATTRIBUTE_CHECKER_UNSUCCESSFUL
source: Content Type,is not same with the one in EncapsulatedContentInfo.Check is unsuccessful.
tr_tr: İçerik Tipi, EncapsulatedContentInfo daki içerik tipiyle aynı değil.Kontrolcü sonucu başarısız.

# CONTENT_TYPE_ATTRIBUTE_DECODE_ERROR
source: Content Type attribute can not be decoded.
tr_tr: İçerik Tipi özelliği decode edilemedi.

# COUNTER_SIGNATURE_CHECKED
source: . counter signature is checked:@
tr_tr: . seri imza kontrol edildi:@

# COUNTER_SIGNATURE_VERIFICATION_RESULTS
source: Verification Results of Counter Signatures of the Signature:@
tr_tr: Imzaya Ait Seri Imza Dogrulama Sonuclari:@

# ISSUER_SERIAL_DOESNOT_MATCH_SIGNER_IDENTIFIER
source: IssuerSerial field in attribute does not match with signeridentifier field of signerinfo.
tr_tr: Özellikteki issuer serial alanı, signerinfo daki signeridentifier alanı ile eşleşmiyor.

source: Message Digest Attribute Checker
tr_tr: İçerik Özet Özelliği Kontrolcüsü

# MESSAGE_DIGEST_ATTRIBUTE_CHECKER_SUCCESSFUL
source: Message digest check is successful.
tr_tr: İçerik özeti özelliği kontrolcüsü başarılı.

# MESSAGE_DIGEST_ATTRIBUTE_CHECKER_UNSUCCESSFUL
source: Value in message digest attribute does not match with the one calculated.Check is unsuccessful.
tr_tr: İçerik özeti özelliğindeki değer hesaplanan değerle aynı değil.Kontrolcü sonucu başarısız.

# MESSAGE_DIGEST_ATTRIBUTE_DECODE_ERROR
source: Message Digest attribute can not be decoded.
tr_tr: İçerik özeti özelliği decode edilemedi.

# MESSAGE_DIGEST_CHECKER_ERROR
source: Error in message digest attribute checker.
tr_tr: İçerik özeti kontrolcüsünde hata oluştu.

# NO_ARCHIVE_TSA_IN_SIGNEDDATA
source: Archive Time Stamp attribute not found in Signed Data.
tr_tr: Arşiv zaman damgası özelliği imza yapısında bulunamadı.

# NO_ARCHIVE_TSA_V2_IN_SIGNEDDATA
source: Archive Time Stamp V2 attribute not found in Signed Data.
tr_tr: Arşiv zaman damgası V2 özelliği imza yapısında bulunamadı.

# NO_CADESC_TSA_IN_SIGNEDDATA
source: CAdES_C Time Stamp attribute not found in Signed Data.
tr_tr: CAdES_C zaman damgası özelliği imza yapısında bulunamadı.

# NO_CERTIFICATE_VALUES_ATTRIBUTE_IN_SIGNEDDATA
source: Certificate Values attribute not found in Signed Data.
tr_tr: Sertifika değerleri özelliği imza yapısında bulunamadı.

# NO_CHECKER_SUCCESSFULL
source: No checker is found.
tr_tr: Zorunlu kontrolcülerden hiç biri çalıştırılamadı.

# NO_COMPLETE_CERTIFICATE_REFERENCES_IN_SIGNEDDATA
source: Complete Certificate References attribute not found in Signed Data.
tr_tr: Sertifika referansları özelliği imza yapısında bulunamadı.

# NO_CONTENT_TIMESTAMP_ATTRIBUTE_IN_SIGNEDDATA
source: Content Timestamp not found in signed data.
tr_tr: İçerik Zaman Damgası özelliği imza yapısında bulunamadı.

# NO_CONTENT_TYPE_ATTRIBUTE_IN_SIGNED_DATA
source: Content Type attribute not found in signed data.
tr_tr: İçerik Tipi özelliği bulunamadı.

# NO_MESSAGE_DIGEST_ATTRIBUTE_FOUND
source: Message Digest attribute not found in signed data.
tr_tr: İçerik özeti özelliği bulunamadı.

# NO_MUST_ATTRIBUTE_IN_SIGNED_DATA
source: Must attribute not found in signed data.
tr_tr: Zorunlu özellik imza yapısında bulunamadı.

# NO_OPTIONAL_ATTRIBUTE_IN_SIGNED_DATA
source: Optional attribute(CADES_C or Reference Timestamp) not found in signed data.
tr_tr: Zorunlu olmayan özellik(CADES_C veya referans zaman damgası) imza yapısında bulunamadı.

# NO_SIGNER_CERTIFICATE_FOUND
source: Signer certificate not found.
tr_tr: İmza sertifikası bulunamadı.

# NO_SIGNING_TIME
source: Error in getting signing time.
tr_tr: İmzalama zamanı alınırken hata oluştu.

# NO_SIGNING_TIME_ATTRIBUTE
source: No signing time attribute to compare times.
tr_tr: Beyan edilen imza zamanı özelliği bulunamadı.

# PRE_VERIFICATION_DONE
source: Pre-verification is done.@
tr_tr: Ön doğrulama yapılmıştır.@

source: Revocation References and Values Match Checker
tr_tr: İptal Bilgisi Referans - Değer Uyumluluk Kontrolcüsü

# REVOCATION_REFERENCES_ATTRIBUTE_DECODE_ERROR
source: Complete Revocation References attribute can not be decoded.
tr_tr: İptal referansları özelliği decode edilemedi.

# REVOCATION_REFERENCES_ATTRIBUTE_NOT_FOUND
source: Complete Revocation References attribute not found.
tr_tr: İptal referansları özelliği imza yapısında bulunamadı.

# REVOCATION_REFS_VALUES_MATCH_SUCCESSFUL
source: Revocation References and Values matching is successful.
tr_tr: İptal referansları ve değerleri eşleştirme kontrolü başarılı.

# REVOCATION_REFS_VALUES_MATCH_UNSUCCESSFUL
source: Revocation References and Values matching is unsuccessful.
tr_tr: İptal referansları ve değerleri eşleştirme kontrolü başarısız..

source: Revocation Values attribute not found.
tr_tr: İptal değerleri özelliği imza yapısında bulunamadı.

# REVOCATION_VALUES_DECODE_ERROR
source: Revocation Values attribute can not be decoded.
tr_tr: İptal değerleri özelliği decode edilemedi.

source: SignatureTimeStamp Attribute Checker
tr_tr: İmza Zaman Damgası Kontrolcüsü

# SIGNATURE_CHECKED_RESULTS
source: . Signature is checked. @Results:@
tr_tr: . İmza kontrol edildi. @Sonuclar:@

source: Signature Checker
tr_tr: İmza Matematiksel Doğrulama Kontrolcüsü

source: Signature Checker Results:@
tr_tr: Imza Kontrolcu Sonuclari:@

source: Signature Policy Attribute Checker
tr_tr: İmza Politikası Özelliği Kontrolcüsü

# SIGNATURE_POLICY_ATTRIBUTE_CHECKER_SUCCESSFUL
source: Hash in signature policy attribute is same as the calculated one.Check is successful.
tr_tr: İmza politikası özelliğindeki özet değeri hesaplanan değerle aynı. Kontrolcü sonucu başarılı.

# SIGNATURE_POLICY_ATTRIBUTE_CHECKER_UNSUCCESSFUL
source: Hash in signature policy attribute is not same as the calculated one.Check is unsuccessful.
tr_tr: İmza politikası özelliğindeki özet değeri hesaplanan değerden farklı.Kontrolcü sonucu başarısız.

# SIGNATURE_POLICY_ATTRIBUTE_DECODE_ERROR
source: Signature Policy Identifier attribute can not be decoded.
tr_tr: İmza politikası özelliği decode edilemedi.

# SIGNATURE_POLICY_ATTRIBUTE_DIGEST_CALCULATION_ERROR
source: Error in signature policy attribute hash control.
tr_tr: İmza politikası kontrolünde özet işleminde hata oluştu.

# SIGNATURE_POLICY_ATTRIBUTE_NOT_FOUND
source: Signature Policy Identifier attribute not found.
tr_tr: İmza politikası özelliği bulunamadı.

# SIGNATURE_TS_CHECK_SUCCESSFUL
source: Signature Timestamp attribute check is successful.
tr_tr: İmza zaman damgası özelliği kontrolü başarılı.

# SIGNATURE_TS_CHECK_UNSUCCESSFUL
source: Signature Timestamp attribute check is unsuccessful.
tr_tr: İmza zaman damgası özelliği kontrolü başarısız.

# SIGNATURE_TS_DECODE_ERROR
source: Signature Timestamp attribute can not be decoded.
tr_tr: İmza zaman damgası özelliği decode edilemedi.

# SIGNATURE_TS_NOT_FOUND
source: Signature Timestamp attribute not found.
tr_tr: İmza zaman damgası özelliği bulunamadı.

# SIGNATURE_VERIFICATION_ERROR
source: Crypto error in signature verification.
tr_tr: İmza matematiksel doğrulamada hata oluştu.

# SIGNATURE_VERIFICATION_SUCCESSFUL
source: Signature crypto verification is successful.
tr_tr: İmza matematiksel doğrulandı.

# SIGNATURE_VERIFICATION_UNSUCCESSFUL
source: Signature crypto verification is unsuccessful.
tr_tr: İmza matematiksel doğrulanamadı.

# SIGNED_ATTRIBUTES_ENCODE_ERROR
source: Signed attributes can not be encoded.
tr_tr: İmzalı özellikler encode edilirken hata oluştu.

source: Signer Certificate:
tr_tr: İmzacı Sertifika:

# SIGNER_DIGEST_ALGORITHM_UNKNOWN
source: Signer digest algorithm is unknown.
tr_tr: İmzacı özet algoritması bilinmiyor.

source: Signing Certificate Attribute Checker
tr_tr: İmzacı Sertifikası Özelliği Kontrolcüsü

# SIGNING_CERTIFICATE_ATTRIBUTE_CHECK_SUCCESSFUL
source: Signing certificate attribute check is successful.
tr_tr: İmzacı sertifikası özelliği kontrolü başarılı.

# SIGNING_CERTIFICATE_ATTRIBUTE_HASH_CALCULATION_ERROR
source: Error in hash calculation of signer certificate.
tr_tr: İmzacı sertifikası özelliği özet kontrolünde hata.

# SIGNING_CERTIFICATE_DECODE_ERROR
source: Signing certificate attribute can not be decoded.
tr_tr: İmzacı sertifikası özelliği decode edilemedi.

source: Signing Certificate V2 Attribute Checker
tr_tr: İmzacı Sertifikası Özelliği V2 Kontrolcüsü

# SIGNING_TIME_ATTRIBUTE_DECODE_ERROR
source: SigningTime attribute can not be decoded.
tr_tr: Beyan edilen imza zamanı özelliği decode edilemedi.

source: Signing Time Checker
tr_tr: Beyan Edilen Zaman Kontrolcüsü

# SIGNING_TIME_CHECKER_SUCCESSFUL
source: Time in signaturetimestamp attribute is after time in signingtime attribute
tr_tr: Beyan edilen imza zamanı, zaman damgasındaki zamandan önce. Kontrolcü sonucu başarılı.

# SIGNING_TIME_CHECKER_UNSUCCESSFUL
source: Time in signaturetimestamp attribute is before time in signingtime attribute. Declared Time: {0}. TimeStamp: {1}.
tr_tr: Beyan edilen imza zamanı, zaman damgasındaki zamandan sonra olamaz. Beyan edilen zaman: {0}. Zaman Damgası: {1}.

source: Sub Checker Results:
tr_tr: Alt Kontrolcu Sonuclari:

source: Timestamped-Certs-Crls-Refs Attribute Checker
tr_tr: Referanslar Zaman Damgası Özelliği Kontrolcüsü

# TIMESTAMPED_CERTS_CRLS_REFS_ATTRIBUTE_CHECKER_SUCCESSFUL
source: Time-stamped-certs-crls-references attribute check is successful.
tr_tr: Referanslar zaman damgası özelliği kontrolü başarılı.

# TIMESTAMPED_CERTS_CRLS_REFS_ATTRIBUTE_CHECKER_UNSUCCESSFUL
source: Time-stamped-certs-crls-references attribute check is unsuccessful.
tr_tr: Referanslar zaman damgası özelliği kontrolü başarısız.

# TIMESTAMPED_CERTS_CRLS_REFS_ATTRIBUTE_DECODE_ERROR
source: Time-stamped-certs-crls-references attribute can not be decoded.
tr_tr: Referanslar zaman damgası özelliği decode edilemedi.

# TIMESTAMPED_CERTS_CRLS_REFS_ATTRIBUTE_NOT_FOUND
source: Time-stamped-certs-crls-references attribute not found.
tr_tr: Referanslar zaman damgası özelliği bulunamadı.

source: TimeStamp Certificate Checker
tr_tr: Zaman Damgası Sertifikası Kontrolcüsü

source: TimeStamp Message Digest Checker
tr_tr: Zaman Damgası Özet Kontrolcüsü

source: TimeStamp Signature Checker
tr_tr: Zaman Damgası İmza Kontrolcüsü

source: TimeStamp Time Checker
tr_tr: Zaman Damgası Zaman Kontrolcüsü

# TS_CERTIFICATE_NOT_FOUND
source: Certificate of timestamp server not found.
tr_tr: Zaman damgası sunucu sertifikası bulunamadı.

# TS_CERTIFICATE_NOT_QUALIFIED
source: Certificate is not authorized for timestamping. //TODO duzelt
tr_tr: Sertifika, zaman damgası sunucu sertifikası olamaz.

# TS_MESSAGE_DIGEST_CHECKER_DECODE_ERROR
source: Error while decoding TSTInfo from timestamp attribute.
tr_tr: Zaman damgasından TSTInfo yapısı decode edilemedi.

# TS_MESSAGE_DIGEST_CHECKER_DIGEST_CALCULATION_ERROR
source: Error while calculating digest value.
tr_tr: Zaman damgası özet değeri hesaplanırken hata oluştu.

# TS_MESSAGE_DIGEST_CHECKER_SUCCESSFUL
source: Digest check is successful.
tr_tr: Zaman damgası özet değeri kontrolü başarılı.

# TS_MESSAGE_DIGEST_CHECKER_UNSUCCESSFUL
source: Digest value in timestamp is not same as the calculated one.Check is unsuccessful.
tr_tr: Zaman damgasından hesaplanan özet değeri ve imzadan hesaplanan özet değeri aynı değil.Kontrolcü sonucu başarısız.

# TS_SIGNATURE_CHECKER_SUCCESSFUL
source: Signature of timestamp is verified.
tr_tr: Zaman damgası imzası doğrulandı.

# TS_SIGNATURE_CHECKER_UNSUCCESSFUL
source: Signature of timestamp is not verified.
tr_tr: Zaman damgası imzası doğrulanamadı.

# TS_TIME_CHECKER_ARCHIVE_BEFORE_ESC
source: Date of archive timestamp is before date of CAdES_C_TimeStamp.
tr_tr: Arşiv zaman damgasının tarihi, ESC zaman damgasınınkinden önce.

# TS_TIME_CHECKER_ARCHIVE_BEFORE_EST
source: Date of archive timestamp is before date of signature timestamp.
tr_tr: Arşiv zaman damgasının tarihi, imza zaman damgasınınkinden önce.

# TS_TIME_CHECKER_ARCHIVE_BEFORE_REFS
source: Date of archive timestamp is before date of references timestamp.
tr_tr: Arşiv zaman damgasının tarihi, Referanslar zaman damgasınınkinden önce.

# TS_TIME_CHECKER_COMPARISON_ERROR
source: Error while comparing dates of timestamps.
tr_tr: Zaman damgalarının, zaman sırası karşılaştırılırken hata oluştu.

# TS_TIME_CHECKER_SIGNATURE_TS_NOT_FOUND
source: Signature timestamp not found.
tr_tr: İmza zaman damgası özelliği bulunamadı.

# TS_TIME_CHECKER_SUCCESSFUL
source: Dates of timestamps are ordered.
tr_tr: Zaman damgalarının tarihleri doğru sıralı.

# TS_TIME_CHECKER_TIME_ERROR
source: Error while getting time info from timestamp.
tr_tr: Zaman damgasından zaman bilgisi alınırken hata oluştu.

# TS_TIME_CHECKER_UNSUCCESSFUL
source: Dates of timestamps are not ordered.
tr_tr: Zaman damgalarının tarihleri sıralı değil.

# _0_MISSING_PARAMETER
source: {0} parameter is missing.
tr_tr: {0} parametresi eksik.

# _0_WRONG_PARAMETER_TYPE_1_
source: {0} parameter is not of type {1}
tr_tr: {0} parametresinin {1} tipinde olması gerekiyor.

# CERT_EXPIRED_ERROR_IN_TS
source: Certificate expired. Can not get time stampt to that signature.
tr_tr: Sertifika süresi dolmuş. Bu imza için zaman damgası alınamıyor.

# CONTENT_AND_SIGNER_DOESNT_MATCH
source: The content that wants to be added to sign and the content that is signed by signer does not match.
tr_tr: Eklenmek istenen veri ile imzacının imzaladığı veri uyuşmuyor.

# EXTERNAL_CONTENT_CANT_ATTACH
source: External content could not added to signed data.
tr_tr: İmzalanan içerik imzaya eklenemedi.

# CONTENT_NULL
source: ContentInfo is null.
tr_tr: ContentInfo null.

# PARENT_SIGNER_ESA
source: One of parent signer type is ESA.
tr_tr: Üst imzacı arşiv tipi imza.

# PROFILE_REVOCATION_VALUE_MATCHER_CHECKER
source: Profile and Revocation Values Match Checker
tr_tr: Profil-İptal Bilgisi Uyumluluk Kontrolcüsü

# PROFILE_REVOCATION_VALUE_MATCHER_CHECKER_SUCCESSFUL
source: Profile and revocation values match is successful.
tr_tr: Profil ve iptal verisi uyumlu.

source: Error in matching of profile and revocation values.
tr_tr: Profil ve iptal verisi uyumsuz.

# SIGNATURE_POLICY_VALUE_NOT_FOUND
source: Signature policy could not be found.
tr_tr: İmza politikası bulunamadı.

# TS_DECODE_ERROR
source: Error at decoding time stamp.
tr_tr: Zaman damgası verisini çözmede hata.

# PROFILE_REVOCATION_VALUE_MATCHER_CHECKER_UNSUCCESSFUL
source: Profile and revocation values match is unsuccessful.
tr_tr: Profil ve iptal verisi uyumsuz.

# PROFILE_AND_SIGNATURE_TYPE_MATCH_UNSUCCESSFUL
source: Profile is "{0}" and signature type is "{1}".
tr_tr: Profil {0} ve imza tipi {1}.

# PROFILE_P3_DOESNOT_USE_CRL
source: Profile is P3 and CRL is not used.
tr_tr: Profil P3 olmasına rağmen CRL kullanılmamış.

# PROFILE_P4_DOESNOT_USE_OCSP
source: Profile is P4 and OCSP is not used.
tr_tr: Profil P4 olmasına rağmen OCSP kullanılmamış.

# CERTIFICATE_REVOCATION_MAP_INCOMPLETE
source: Some references or values are missing.
tr_tr: Bazı referanslar veya değerler eksik.

source: Turkish Profile Attributes Checker
tr_tr: Türk Profilleri Özellikleri Kontrolcüsü

# TURKISH_PROFILE_ATTRIBUTES_CHECKER_SUCCESSFUL
source: Profile attributes compatible with turkish standards.
tr_tr: Profil özellikleri Türk standartlarına uygun.

# SIGNATURE_TIME_ERROR
source: Error while getting times from signature.
tr_tr: İmzadan zaman bilgileri alınırken hata oluştu.

source: Signing Certificate V2 Attribute missing.
tr_tr: İmzacı Sertifikası Özelliği V2 bulunamadı.

source: SigningTime attribute missing.
tr_tr: Beyan edilen zamanı özelliği bulunamadı.

# TS_TIME_NOT_AFTER_2H
source: Signature time stamp must be taken within 2 hours after signing time.
tr_tr: İmza zaman damgası, beyan edilen zamandan sonraki 2 saat içinde alınmamış.

# PROFILE_POLICY_HASH_NOT_SHA256
source: Policy digest algorithm is not SHA-256.
tr_tr: Politika özet algoritması SHA-256 değil.

# NOT_A_TURKISH_PROFILE
source: Not one of Turkish profile.No check done.
tr_tr: Türk profillerinden biri değil.Herhangi bir kontrol yapılmadı.

# ARCHIVE_TIMESTAMP_INVALID
source: Taken ArchiveTimeStampAttr is invalid.
tr_tr: Alınan arşiv zaman damgası geçersiz.

# CADES_C_TIMESTAMP_INVALID
source: Taken CAdES_C_TimeStampAttr is invalid.
tr_tr: Alınan CaDES-C zaman damgası geçersiz.

# CERTSCRLS_TIMESTAMP_INVALID
source: Taken TimeStampedCertsCrlsAttr is invalid.
tr_tr: Alınan referans zaman damgası geçersiz.

# SIGNATURE_TIMESTAMP_INVALID
source: Taken signaturetimestamp is invalid.
tr_tr: Alınan imza zaman damgası geçersiz.

# ISSUER_SERIAL_DOESNOT_EXISTS
source: Attribute does not contain issuerSerial field.
tr_tr: Özellik issuer serial alanı içermiyor.

source: Archive TimeStamp V3 Attribute Checker
tr_tr: Arşiv Zaman Damgası V3 Özelliği Kontrolcüsü

# ARCHIVE_TSA_V3_CHECK_SUCCESSFUL
source: Archive Time Stamp V3 attribute check is successful.
tr_tr: Arşiv zaman damgası V3 özelliği kontrolü başarılı.

# ARCHIVE_TSA_V3_CHECK_UNSUCCESSFUL
source: Archive Time Stamp V3 attribute check is unsuccessful.
tr_tr: Arşiv zaman damgası V2 özelliği kontrolü başarısız.

# ARCHIVE_TSA_V3_DECODE_ERROR
source: Archive Time Stamp V3 attribute can not be decoded in Signed Data.
tr_tr: Arşiv zaman damgası V2 özelliği decode edilemedi.

# ATS_HASH_INDEX_ATTRIBUTE_CHECKER
source: Archive TimeStamp V3 Component Checker
tr_tr: Arşiv Zaman Damgası V3 Kapsam Kontrolcüsü

# ATS_HASH_INDEX_ATTRIBUTE_CHECKER_SUCCESSFUL
source: Archive TimeStamp V3 Component Checker is successful.
tr_tr: Arşiv Zaman Damgası V3 Kapsam Kontrolcüsü başarılı.

# NO_ARCHIVE_TSA_V3_IN_SIGNEDDATA
source: Archive Time Stamp V3 attribute not found in Signed Data.
tr_tr: Arşiv zaman damgası V2 özelliği imza yapısında bulunamadı.

# PARENT_SIGNER_ESAv2
source: One of parent signer type is ESA with v2.
tr_tr: Üst imzacılardan biri arşiv zaman damgası V2 özelliği olan arşiv tipi imza.

# PARENT_SIGNER_ESAv3
source: One of parent signer type is ESA with v3.
tr_tr: Üst imzacılardan biri arşiv zaman damgası V3 özelliği olan arşiv tipi imza.

# UNSIGNED_ATTRIBUTE_MISSING
source: One of unsigned attributes missing.
tr_tr: İmzasız özelliklerden biri çıkarılmış.

# UNSIGNED_ATTRIBUTE_NOT_INCLUDED
source: One of unsigned attributes not included to archive timestamp.
tr_tr: İmzasız özelliklerden biri arşiv zaman damgasına dahil değil.

# CERTIFICATE_EXPLANATION
source: Certificate: {0}.
tr_tr: Sertifika: {0}.

# GETTING_TS_CERTIFICATE_VALIDATION_DATA_ERROR
source: Error while getting timestamp certificate validation data.
tr_tr: Zaman damgası sertifikasının doğrulama verilerinin alınmasında hata oluştu.

# CERTIFICATE_CHECKER_FAIL
source: {0} failed
tr_tr: {0} başarısız

# CERTIFICATE_NO_PATH_FOUND
source: No trusted path found. Certificate's root sertificate may not be one of your trusted certificates.
tr_tr: Güvendiğiniz bir sertifika zinciri oluşturulamadı. Sertifikanın kök sertifikası güvenilir sertifikalarınızdan biri olmayabilir

source: Unknown commitment type.
tr_tr: Bilinmeyen imza amacı.
