Repository: itu-itis21-kurtulusu20/ma3api-migration
Catalog: api-xmlsignature/csharp/Properties/Resource.*.resx
Languages: tr_tr

# validation.policy.cantFind
source: SignaturePolicy cannot be found.
tr_tr: İmza politikası (SignaturePolicy) bulunamadı.

# validation.timestamp.cantFind
source: No TimeStamp found in "{0}".
tr_tr: "{0}" içinde zaman damgası bulunamadı.

# core.verified
source: Core validation succeeded.
tr_tr: Temel doğrulama başarılı.

# config.validatorClassNotFound
source: Validator class "{0}" not found.
tr_tr: Doğrulayıcı sınıfı "{0}" bulunamadı.

# validation.certificate.cantFound
source: Cannot determine signing certificate.
tr_tr: İmzacı sertifika belirlenemedi.

# validation.policy.valid
source: SignaturePolicyIdentifier is valid.
tr_tr: İmza politikası geçerli.

# core.referencesAreValid
source: References are valid.
tr_tr: Referanslar geçerli.

# config.invalidValidator
source: Class "{0}" for profile "{1}" is not a validator.
tr_tr: "{1}" profili için "{0}" sınıfı geçerli bir doğrulayıcı değil.

# config.cyclicInheritanceForProfileValidators
source: Validation profiles has cyclic dependency.
tr_tr: Doğrulama profilleri çözümsüz bağımlılık gösteriyor.

# errors.cantDecode
source: Cannot decode {1} as {0}.
tr_tr: {0}, {1} decode edilemedi.

# validation.signingTime.notWithinCertificatePeriod
source: SigningTime property is not within validity period of signers certificate.
tr_tr: İmza zamanı (SigningTime) anında sertifika geçerli değil.

source: OCSP
tr_tr: ÇiSDuP

# validation.references.certRefs.extraCert
source: CompleteCertificateRefs contains a reference not existing in cert validation path!
tr_tr: Sertifika referanslarında doğrulamada kullanılmayan sertifika var!

# core.timestamp.cantExtractDigestAlg
source: Cannot get digest algorithm from Timestamp.
tr_tr: Zaman damgasından özet algoritması alınamadı.

# validation.references.certRefs.missingCert
source: CompleteCertificateRefs does not contain certificate in validation path!
tr_tr: Doğrulamada kullanılan bir sertifika, sertifika referanslarında yok!

# validation.dataObjectFormat.mimeMismatch
source: DataObjectFormat/Reference MIME Type mismatch! Expected "{0}", found "{1}".
tr_tr: DataObjectFormat/Referans MIME tipi uyumsuzluğu! Beklenen: "{0}", bulunan "{1}".

# transform.unsupported
source: Unsupported transformation: "{0}".
tr_tr: Desteklenmeyen dönüşüm: "{0}".

# resolver.xpointerSupportLimited
source: XPointer support is only for '/' or Id. Cannot resolve "{0}"
tr_tr: XPointer desteği yalnızca '/' veya Id için geçerli. "{0}" çözülemedi.

# validation.references.revRefs.missing
source: CompleteRevocationRefs does not contain {0} in validation path!
tr_tr: Doğrulamada kullanılan {0}, iptal bilgisi referanslarında yok!

# validation.timestamp.notWithinCertificatePeriod
source: {0}[{1}] time "{2}", is not within certificate validity period.
tr_tr: {0}[{1}] zaman damgası tarihi "{2}", sertifika geçerlilik periyodu içerisinde değil.

# validation.timestamp.certificateNotValidated
source: Cannot verify timestamp signer certificate.
tr_tr: Zaman damgası imzacı sertifikası doğrulanamadı.

# core.model.missingDataObjectFormatContent
source: At least one element of Description, ObjectIdentifier and/or MimeType MUST be present within DataObjectFormat
tr_tr: Description, ObjectIdentifier ve/veya MIME tipinden en az biri DataObjectFormat içinde yer almalı.

# error.formatAlreadyEvolved
source: Signature already in {0} format.
tr_tr: İmza zaten {0} formatında.

# core.cantVerify.reference
source: Reference "{0}" could not be validated.
tr_tr: Referans "{0}" doğrulanamadı.

# validation.signingCertificate.serialMismatch
source: Certificate serial number is : "{0}", but should have been: "{1}".
tr_tr: Geçersiz sertifika seri numarası. Bulunan: "{0}", beklenen: "{1}".

# validation.timestamp.valid
source: {0} is valid.
tr_tr: {0} geçerli.

# core.timestamp.cantExtractTSTInfo
source: Cannot get TSTInfo from TimeStamp.
tr_tr: Zaman damgasından TSTInfo alınamadı.

source: CRL
tr_tr: SİL

# core.cantResolve.signingCertificateAttribute
source: Error occurred while resolving referenced certificate in SigningCertificate attribute.
tr_tr: SigningCertificate özniteliğinden sertifika çözümlenemedi.

# errors.cantDigest
source: Cannot digest "{0}".
tr_tr: "{0}" özeti alınamadı.

# transform.enveloped.cantFindSignature
source: Cannot find Signature element that belongs to Enveloped Signature transform.
tr_tr: Zarflanmış imza dönüşümüne ait imza bulunamadı.

# errors.kripto.hash
source: Cannot hash using algorithm "{0}".
tr_tr: "{0}" özet algoritması kullanılırken bir hata oluştu.

# validation.certificate.validatedSigner
source: Successfully validated signer certificate.
tr_tr: İmzacı sertifikası doğrulandı.

# validation.certificate.cantValidateSigner
source: Cannot validate signer certificate: {0}
tr_tr: İmzacı sertifikası doğrulanamadı: {0}

# validation.signingTime.notFound
source: No signing time present.
tr_tr: İmza zamanı(SigningTime) bulunamadi.

# validation.timestamp.signature.invalid
source: Timestamp signature invalid.
tr_tr: Zaman damgası imzası geçersiz.

# config.missingAncestorToInheritProfiles
source: Validation profile "{0}" cannot inherit validators from missing "{1}" profile.
tr_tr: "{0}" doğrulama profili çözümlenemeyen "{1}" profilinden doğrulayıcıları miras alamaz.

# config.invalidProfile
source: Cannot resolve signature profile "{0}" for validation configuration.
tr_tr: Doğrulama konfigürasyonu için "{0}" imza profili çözülemedi.

# validation.data.resolutionMismatch
source: Resolved {0} [uri:'{1}'] mismatch {2} : {3}
tr_tr: Çözülen {0} [uri:'{1}'] ile {2} : {3} uyuşmuyor.

# validation.signingCertificate.valid
source: SigningCertificate property is valid.
tr_tr: SigningCertificate özelliği geçerli.

# validation.policy.invalidDigest
source: Invalid SignaturePolicy digest.
tr_tr: İmza politikası özeti geçersiz.

# validation.timestamp.cantBeBeforeSigningTime
source: {0}[{1}] time "{2}", cannot be before SigningTime attribute "{3}".
tr_tr: {0}[{1}] tarihi "{2}", beyan edilen imza zamanı "{3}" özelliğinden önce.

# validation.dataObjectFormat.valid
source: DataObjectFormat property is valid.
tr_tr: DataObjectFormat özelliği geçerli.

# validation.timestamp.invalidDigest
source: {0}[{1}] has invalid digest value.
tr_tr: {0}[{1}] geçersiz özet değerine sahip.

source: signer
tr_tr: imzacı

# core.model.invalidResponderId
source: Invalid ResponderId. Either key or name values shall be declared.
tr_tr: Geçersiz ResponderId. Anahtar yada isim değerleri tanımlı olmalı.

# validation.references.certRefs.valid
source: CompleteCertificateRefs is consistent.
tr_tr: Sertifika referansları tutarlı.

# errors.base64
source: Error in Base64 conversion.
tr_tr: Base64 çeviriminde hata.

# validation.references.revRefs.valid
source: CompleteRevocationRefs is consistent.
tr_tr: İptal bilgisi referansları tutarlı.

# validation.signingTime.valid
source: Signing Certificate is valid at signing time signed property.
tr_tr: İmza sertifikası imza zamanı(SigningTime) anında geçerli.

# validation.timestamp.vdata.cantResolveByURI
source: Cannot resolve Timestamp(uri:{0}) for TimestampValidationData
tr_tr: Zaman damgası doğrulama verisine ait zaman damgası (uri:{0}) bulunamadı.

# errors.cantAddDocument
source: Cannot add document:"{0}" to XML Signature.
tr_tr: "{0}" dökümanı XML imzaya eklenemedi.

# unknown.encoding
source: Unknown encoding type "{0}"
tr_tr: Bilinmeyen encoding tipi "{0}"

# errors.null
source: {0} cannot be 'null'.
tr_tr: {0} 'null' olamaz.

# validation.signingCertificate.invalidDigest
source: Invalid certificate digest.
tr_tr: Geçersiz sertifika özeti.

# errors.cantInit
source: Could not init "{0}"
tr_tr: "{0}" ilklendirilemedi.

# validation.timestamp.signature.verificationError
source: Cannot verify Timestamp signature
tr_tr: Zaman damgası imzası doğrulanırken hata oluştu.

# core.invalid.secretkey
source: Invalid secret key : {0}
tr_tr: Geçersiz gizli anahtar: "{0}"

# errors.cantFindCertificate
source: Cannot find certificate.
tr_tr: Sertifika bulunamadı.

# core.cantVerify.signatureValue
source: Inconsistent signature value.
tr_tr: Tutarsız imza değeri.

# errors.verify
source: Verify error.
tr_tr: Doğrulama hatası.

# errors.cantEncode
source: Cannot encode {1} as {0}.
tr_tr: {0}, {1} encode edilemedi.

# errors.cantUpdate
source: Cannot update "{0}".
tr_tr: "{0}" güncellenemedi.

# transform.isNotApplicableFor
source: Cannot apply "{0}" transform to "{1}".
tr_tr: "{0}" dönüşümü "{1}"'e uygulanamaz.

# xml.WrongElement
source: Cannot create a {0} from a {1} element
tr_tr: {1} elementinden {0} yaratılamadı.

# transform.error
source: Error occurred while applying {0} transform.
tr_tr: {0} dönüşümü uygulanamdı.

# error.formatCantEvolveMultiple
source: Evolution from {0} to {1} format is not supported. Evolve to {2} format first.
tr_tr: {0} - {1} format yükseltemesi desteklenmiyor. Önce {2} formatına yükseltin.

# core.invalidKeyInfo
source: Cannot resolve Certificate from KeyInfo.
tr_tr: KeyInfo'dan Sertifika çözülemedi.

# transform.errorApplyingTo
source: Error occurred applying "{0}" transform to "{1}".
tr_tr: "{0}" dönüşümü "{1}"'e uygulanamadı.

# config.notDefined
source: "{0}" not defined in XML Signature configuration.
tr_tr: "{0}" XML imza konfigürasyonunda tanımlı değil.

# validation.timestamp.invalidFormat
source: {0}[{1}] is not in TimeStamp format.
tr_tr: {0}[{1}] zaman damgası formatında değil.

# validation.references.revRefs.extra
source: CompleteRevocationRefs contains a reference not existing in cert validation path!
tr_tr: İptal bilgisi referanslarında doğrulamada kullanılmayan kaynak var!

# errors.cantOutputXml
source: Cannot output signature.
tr_tr: XML imza çıktısı elde edilemedi.

# validation.timestamp.error
source: Error occurred while validating {0}[{1}].
tr_tr: {0}[{1}] doğrulanırken hata oluştu.

# errors.cantCanonicalize
source: Cannot canonicalize {0}.
tr_tr: {0} canonical forma dönüştürülemedi.

# core.invalid.publickey
source: Invalid {0} public key : {1}
tr_tr: {0} açık anahtarı "{1}" geçersiz.

# error.formatCantAddArchiveTS
source: Before adding additional Archive timestamps, evolve to A format first.
tr_tr: Ekstra arşiv zaman damgası eklemeden önce imzayı XAdES A formatına yükseltin..

# validation.signingCertificate.issuerMismatch
source: Certificate issuer is : "{0}", but should have been: "{1}".
tr_tr: Geçersiz sertifika yayıncı değeri. Bulunan: "{0}", beklenen: "{1}".

# validation.timestamp.vdata.cantResolveI
source: Cannot resolve Timestamp for TimestampValidationData
tr_tr: Zaman damgası doğrulama verisine ait zaman damgası bulunamadı.

# validation.timestamp.signature.verified
source: Timestamp signature verified.
tr_tr: Zaman damgası imzası doğrulandı.

# core.invalid.privatekey
source: Invalid {0} private key : {1}
tr_tr: {0} özel anahtarı "{1}" geçersiz.

# config.cantFind
source: Cannot find "{0}" for init!
tr_tr: İlklendirme için "{0}" bulunamadı!

# resolver.cantFindResolverForUri
source: Cannot find any resolver suitable for URI : "{0}"
tr_tr: URI: "{0}" için geçerli bir çözücü bulunamadı.

# core.timestamp.cantTimestamp
source: Cannot timestamp "{0}"
tr_tr: "{0}" için zaman damgası oluşturulamadı.

# validation.policy.cantFindByUri
source: SignaturePolicy referenced by SPURI cannot be found.
tr_tr: SPURI tarafından işaret edilen imza politikası bulunamadı.

# validation.timestamp.vdata.orderError
source: Timestamp should be added before its validation data"
tr_tr: Zaman damgası, doğrulama verisinden hemen önce yer almalıdır

# core.cantVerify
source: Core validation failed.
tr_tr: Temel doğrulama başarısız.

# core.timestamp.cantExtractTime
source: Cannot get time from Timestamp.
tr_tr: Zaman damgasından zaman bilgisi alınamadı.

source: certificate
tr_tr: sertifika

# unknown.algorithm
source: Unknown algorithm: "{0}".
tr_tr: Bilinmeyen algoritma: "{0}".

# errors.convert
source: Error occurred converting {0} to {1}.
tr_tr: {0}, {1} çeviriminde hata.

# core.cantCalculateSignatureValue
source: Cannot calculate signature value.
tr_tr: İmza değeri hesaplanamadı.

# core.timestamp.cantEncode
source: Cannot encode TimeStamp.
tr_tr: Zaman damgası encode edilemedi.

# config.cantLoad
source: Cannot load "{0}" for init!
tr_tr: İlklendirme için "{0}" yüklenemedi!

# validation.timestamp.certificateNotFound
source: Cannot find {0} timestamp signer certificate.
tr_tr: {0} zaman damgası imzacı sertifikası bulunamadı.

source: signature
tr_tr: imza

# xml.WrongContent
source: Cannot find {0} in {1}
tr_tr: {1} içinde {0} bulunamadı.

# error.formatCantEvolve
source: Evolution from {0} to {1} format is not supported.
tr_tr: {0} - {1} format yükseltemesi desteklenmiyor.

# validation.signingCertificate.notFound
source: SigningCertificate property not found.
tr_tr: SigningCertificate özelliği bulunamadı.

# validation.data.cantConstruct
source: Cannot construct {0}. {1} in {2}
tr_tr: {2} içerisindeki {0}. {1} oluşurulamadı.

source: Unknown key value.
tr_tr: Bilinmeyen anahtar değeri.

# resolver.cantResolveUri
source: Cannot resolve URI : "{0}"
tr_tr: URI: "{0}" çözülemedi.

# core.ocsp.cantResolveProducedAt
source: Cannot resolve produce date from OCSP response.
tr_tr: OCSP cevabında üretim tarihi çözülemedi.

# errors.sign
source: Sign error.
tr_tr: İmzalama hatası.

# core.invalidRetrievalMethod
source: Retrieval Method must return DOM element but returned: "{0}"
tr_tr: RetrivealMethod DOM elemanı döndürmeli, fakat "{0}" döndürdü.

# validation.policy.invalidDigestByUri
source: Invalid digest for SignaturePolicy referenced by SPURI.
tr_tr: SPURI tarafından işaret edilen imza politikasının özet değeri hatalı.

# validation.timestamp.cantBeBeforeTimestamp
source: {0}[{1}] time "{2}", cannot be before {3} time "{4}".
tr_tr: {0}[{1}] zaman damgası tarihi "{2}", {3} zaman damgası tarihi "{4}"'den önce.

# errors.cantFind
source: Cannot find "{0}".
tr_tr: "{0}" bulunamadı.

# core.invalid.formatOf
source: Invalid {0} format of {1}
tr_tr: {1} için geçersiz {0} formatı.

# errors.nullElement
source: Expected: {0} element instead of 'null'.
tr_tr: {0} elementi beklenirken 'null' geldi.

# core.model.individualDataObjectsCantReferenceQP
source: SignedProperties typed Reference cannot be included to IndividualDataObjectsTimeStamp.
tr_tr: SignedProperties tipli Referans IndividualDataObjectsTimeStamp elemanına eklenemez.

# core.timestamp.cantAddBeforeSignatureValue
source: Cannot calculate value for Signature TimeStamp. Sign document first.
tr_tr: Imza zaman damgası oluşturulamıyor. Önce dökümanı imzalayın.

# core.etsiRequiresCertificate
source: For ETSI formats key information shall be provided as Public Certificate.
tr_tr: ETSI imza profilleri anahtar bilgisi Açık Anahtar tipinde olmalı.

# errors.invalid.certificate
source: Invalid certificate.
tr_tr: Geçersiz sertifika.

# validation.policy.cantFindId
source: SignaturePolicy is not implied and SignaturePolicyId cannot be found.
tr_tr: SignaturePolicy ima edilmemiş ve SignaturePolicyId bulunamadı.

# core.signedDocumentVerified
source: SignedDocument validation succeeded.
tr_tr: İmzali döküman doğrulandı.

# validation.dataObjectFormat.noReference
source: DataObjectFormat must refer to a Reference!
tr_tr: DataObjectFormat'ta referans tanımlanmamış.

source: public key
tr_tr: açık anahtar

# core.model.invalidEncapsulatedEncoding
source: Encapsulated {0} cannot have encoding type other than 'DER'.
tr_tr: Encapsulated {0} 'nin encoding tipi 'DER' olmalı.

# core.model.commitmentNeedObjectReferences
source: Either object references must exist or CommitmentIndication should be for all signed data objects
tr_tr: Ya nesne referansları olmalı, yada CommitmentIndication tüm imzalı objeler için tanımlanmalı.

# validation.certificate.error
source: Error occurred verifying signer certificate: {0}
tr_tr: İmzacı sertifikası doğrulanırken hata oluştu: {0}

# unsupported.operation
source: Unsupported operation: "{0}".
tr_tr: Desteklenmeyen işlem: "{0}".

# errors.duplicate
source: Duplicate "{0}".
tr_tr: Birden fazla "{0}".

# config.inconsistentGracePeriod
source: Last Revocation Period must be higher than grace period!
tr_tr: Son iptal kabul periyodu, grace period değerinden büyük olmalıdır!

# configFile
source: xml signature configuration file(xmlsignature-config.xml)
tr_tr: xml imza konfigürasyon dosyası(xmlsignature-config.xml)

# core.cantCreateBuffer
source: Cannot create {0} buffer for "{1}"
tr_tr: {0} arabelleği "{1}" için yaratılamadı.

# core.cantResolve.verificationKey
source: Cannot resolve Key for verification.
tr_tr: Doğrulama için anahtar çözülemedi.

# core.timestamp.cantExtractSignedData
source: Cannot get SignedData from TimeStamp.
tr_tr: Zaman damgasından SignedData alınamadı.

# validation.dataObjectFormat.encodingMismatch
source: DataObjectFormat/Reference Encoding mismatch! Expected "{0}", found "{1}".
tr_tr: DataObjectFormat/Referans Encoding uyumsuzluğu! Beklenen: "{0}", bulunan "{1}".

# core.cantGeneratePublicKey
source: Error occurred in {0} public key generation.
tr_tr: {0} açık anahtar oluşturulamadı.

# errors.cantConstructSignature
source: Cannot construct XML Signature from document: "{0}"
tr_tr: "{0}" dökümanından XML imza elde edilemedi.

# core.ocsp.cantResolveResponderId
source: Cannot resolve ResponderId from OCSP response.
tr_tr: OCSP cevabında ResponderId çözülemedi.

# core.cantResolveRetrievalMethod
source: Cannot dereference Retrieval Method: "{0}"
tr_tr: RetrievalMethod: "{0}" çözülemedi.

# config.missingValidationProfile
source: Validation profile "{0}" is not declared on config file.
tr_tr: Doğrulama profili "{0}" konfigürasyon dosyasında tanımlı değil.

# core.verified.signatureValue
source: Signature value validated.
tr_tr: İmza değeri doğrulandı.

# validation.values.certVals.countMismatch
source: CertificateValues and CompleteCertificateRefs counts mismatch!
tr_tr: Sertifika referansları ile değerlerinin sayıları birbirini tutmuyor!

# validation.values.certVals.missingValue
source: Cannot find value in CertificateValues for a reference!
tr_tr: Sertifika değerlerinde karşılığı olmayan referans var!

# validation.values.certVals.valid
source: CertificateValues is consistent with CompleteCertificateRefs.
tr_tr: Sertifika değerleri tutarlı.

# validation.values.revVals.countMismatch
source: RevocationValues and CompleteRevocationRefs counts mismatch in {0}!
tr_tr: İptal bilgisi referansları ile değerlerinin {0} sayıları birbirini tutmuyor!

# validation.values.revVals.missingValue
source: Cannot find {0} value in RevocationValues for a reference!
tr_tr: İptal bilgisi değerlerinde karşılığı olmayan {0} referansı var!

# validation.values.revVals.valid
source: RevocationValues is consistent with CompleteRevocationRefs.
tr_tr: İptal bilgisi değerleri tutarlı.

# validation.policy.cantValidatePolicy
source: Unable to validate signature policy ID.
tr_tr: İmza politikası doğrulanamadı.

# validation.policy.not2h
source: Signature time stamp must be taken within 2 hours after signing time.
tr_tr: İmza zaman damgası, beyan edilen zamandan sonraki 2 saat içinde alınmamış.

# validation.policy.notsha2
source: Policy digest algortihm is not SHA-256.
tr_tr: Politika özet algoritması SHA-256 değil.

# validation.policy.notTurkishProfile
source: Signature does not have Turkish signature profile.
tr_tr: İmza Türk imza profilleri içermiyor.

# validation.policy.signaturePolicyAttributes
source: Signature Policy Attribute Check
tr_tr: İmza politikası özellik kontrolü

# validation.policy.successful
source: Profile attributes compatible with standards.
tr_tr: Profil özellikleri standartlara uygun.

# validation.timestamp.failed
source: Cannot validate timestamp {0}, because {1}.
tr_tr: Zaman damgası {0} doğrulanamadı, çünkü {1}.

# validation.policy.invalidRevocationDataType
source: Revocation data type is not convenient for used profile.
tr_tr: Iptal bilgisi tipi profile uygun degil.

# validation.policy.invalidSignatureType
source: Signature format is not convenient for used profile.
tr_tr: Imza formati profile uygun degil.

# validation.policy.cantcheck
source: Profile exists but cannot recognized.
tr_tr: Profil var ama tanimlanamadi.

# validation.policy.noOCSP
source: Profile has to have OCSP as revocation data for signer's certificate.
tr_tr: Profile gore imzaci sertifikasinin iptal bilgisi olarak CiSDuP kullanmaliydi.

# validation.policy.timeStampCheckError
source: Error while checking timestamp conformance for signature profile.
tr_tr: Imza zaman damgasi imza profili uygunlugu kontrol edilirken hata olustu.

# validation.signingCertificate.notSha2
source: Signing Certificate digest algorithm is not SHA-256.
tr_tr: Imzaci sertifikasi ozet algoritmasi SHA-256 degil.

# validation.timestamp.certificateValue.noRootCert
source: Timestamp does not have its root certificate in validation data.
tr_tr: Zaman damgasi dogrulama bilgisi icinde kok sertifikasini icermiyor.

# validation.timestamp.notAfterSigningTime
source: Signature timestamp must be taken after signing time.
tr_tr: Imza zaman damgasi, imza zamanindan sonra olmali.

# validation.timestamp.notWithin2HoursOfSigningTime
source: Signature timestamp must be taken within 2 hours after signing time.
tr_tr: Imza zaman damgasi, imza zamanindan sonra 2 saat icinde alinmali.

# validation.timestamp.revocationValue.noCRL
source: Timestamp does not have CRL for revocation data.
tr_tr: Zaman damgasi iptal bilgisi olarak CRL icermiyor.

# validation.check.reference
source: Reference Check
tr_tr: Referans Kontrolü

# validation.check.certificate
source: Certificate Validation Check
tr_tr: Sertifika Doğrulama

# validation.check.certRefs
source: Certificate References Check
tr_tr: Sertifika Referanslar Kontrolü

# validation.check.certValues
source: Certificate Values Check
tr_tr: Sertifika Değerleri Kontrolü

# validation.check.dataObjectFormat
source: Data Object Format Check
tr_tr: Veri Nesne Formatı Kontrolü

# validation.check.encapsulatedTS
source: Encapsulated Timestamp Check
tr_tr: Dahili Zaman Damgası Kontrolü

# validation.check.keyInfo
source: Key Info Check
tr_tr: Anahtar Bilgisi Kontrolü

# validation.check.revocationRefs
source: Revocation References Check
tr_tr: İptal Bilgisi Referanslar Kontrolü

# validation.check.revocationValues
source: Revocation Values Check
tr_tr: İptal Bilgileri Kontrolü

# validation.check.signaturePolicy
source: Signature Policy Check
tr_tr: İmza Politikası Kontrolü

# validation.check.signaturePolicyAttributes
source: Signature Policy Attribute Check
tr_tr: İmza Politikası Özellik Kontrolü

# validation.check.signatureValue
source: Signature Value Check
tr_tr: İmza Değeri Kontrolü

# validation.check.signedDoc
source: Signed Document Check
tr_tr: İmzalı Doküman Kontrolü

# validation.check.signingCertificate
source: Signing Certificate Check
tr_tr: İmzacı Sertifika Kontrolü

# validation.check.signingTime
source: Signing Time Check
tr_tr: İmza Zamanı Kontrolü

# validation.check.timestamp
source: {0} Timestamp Check
tr_tr: {0} Zaman Damgası Kontrolü

# validation.check.xmlSignature
source: XML Signature Check
tr_tr: XML İmza Kontrolü

# validation.signatureAlgorithm.notSha2
source: Signature algorithm is not SHA-256.
tr_tr: Imza algoritmasi SHA-256 degil.
